## Pandas 라이브러리 불러오기

In [1]:
import pandas as pd

## csv 파일 불러오기

In [3]:
df = pd.read_csv('data/credit.csv')

## 데이터프레임 구조

* 행과 열
* 인덱스 개념

In [4]:
df

,Income,Limit,Rating,Cards,Age,Education,Gender,Student,Married,Ethnicity,Balance
0,14.891,3606,283,2,34,11,Male,No,Yes,Caucasian,333
1,106.025,6645,483,3,82,15,Female,Yes,Yes,Asian,903
2,104.593,7075,514,4,71,11,Male,No,No,Asian,580
3,148.924,9504,681,3,36,11,Female,No,No,Asian,964
4,55.882,4897,357,2,68,16,Male,No,Yes,Caucasian,331
...,...,...,...,...,...,...,...,...,...,...,...
395,12.096,4100,307,3,32,13,Male,No,Yes,Caucasian,560
396,13.364,3838,296,5,65,17,Male,No,No,African American,480
397,57.872,4171,321,5,67,12,Female,No,Yes,Caucasian,138
398,37.728,2525,192,1,44,13,Male,No,Yes,Caucasian,0
399,18.701,5524,415,5,64,7,Female,No,No,Asian,966

## 데이터 행 선택하기

* loc로 선택: 인덱스를 고유값으로 봄
* iloc로 선택: 인덱스 고유값 상관없이 i번째 행 고르기

In [5]:
df.loc[0]

Income          14.891
Limit             3606
Rating             283
Cards                2
Age                 34
Education           11
Gender            Male
Student             No
Married            Yes
Ethnicity    Caucasian
Balance            333
Name: 0, dtype: object

In [18]:
df.loc[0:5]

,Income,Limit,Rating,Cards,Age,Education,Gender,Student,Married,Ethnicity,Balance
0,14.891,3606,283,2,34,11,Male,No,Yes,Caucasian,333
1,106.025,6645,483,3,82,15,Female,Yes,Yes,Asian,903
2,104.593,7075,514,4,71,11,Male,No,No,Asian,580
3,148.924,9504,681,3,36,11,Female,No,No,Asian,964
4,55.882,4897,357,2,68,16,Male,No,Yes,Caucasian,331
5,80.180,8047,569,4,77,10,Male,No,No,Caucasian,1151

In [6]:
df.iloc[0]

Income          14.891
Limit             3606
Rating             283
Cards                2
Age                 34
Education           11
Gender            Male
Student             No
Married            Yes
Ethnicity    Caucasian
Balance            333
Name: 0, dtype: object

In [9]:
# 5부터 9번째 인덱스의 열 고르기
df.iloc[5:10]

,Income,Limit,Rating,Cards,Age,Education,Gender,Student,Married,Ethnicity,Balance
5,80.180,8047,569,4,77,10,Male,No,No,Caucasian,1151
6,20.996,3388,259,2,37,12,Female,No,No,African American,203
7,71.408,7114,512,2,87,9,Male,No,No,Asian,872
8,15.125,3300,266,5,66,13,Female,No,No,Caucasian,279
9,71.061,6819,491,3,41,19,Female,Yes,Yes,African American,1350

## 데이터 열 선택하기

* 단일 열 선택
* 여러개 열 선택
* 열이름 얻어내기

In [11]:
df['Income']

0       14.891
1      106.025
2      104.593
3      148.924
4       55.882
        ...
395     12.096
396     13.364
397     57.872
398     37.728
399     18.701
Name: Income, Length: 400, dtype: float64

In [12]:
df[['Income']]

      Income
0     14.891
1    106.025
2    104.593
3    148.924
4     55.882
..       ...
395   12.096
396   13.364
397   57.872
398   37.728
399   18.701

[400 rows x 1 columns]

In [13]:
# 복수의 열 선택하기
df[['Income','Cards']]

      Income  Cards
0     14.891      2
1    106.025      3
2    104.593      4
3    148.924      3
4     55.882      2
..       ...    ...
395   12.096      3
396   13.364      5
397   57.872      5
398   37.728      1
399   18.701      5

[400 rows x 2 columns]

In [14]:
# 열이름 얻어내기
df.columns

Index(['Income', 'Limit', 'Rating', 'Cards', 'Age', 'Education', 'Gender',
       'Student', 'Married', 'Ethnicity', 'Balance'],
      dtype='object')

## 열과 행을 동시에 선택하기

In [15]:
df.loc[0,'Income']

14.891

In [23]:
df.loc[2:5,['Income','Cards']]

    Income  Cards
2  104.593      4
3  148.924      3
4   55.882      2
5   80.180      4

In [22]:
df.iloc[2:5, 0:2]

    Income  Limit
2  104.593   7075
3  148.924   9504
4   55.882   4897

In [24]:
# 행부터 선택하고 열선택도 가능
df[['Income','Limit']].iloc[2:5]

    Income  Limit
2  104.593   7075
3  148.924   9504
4   55.882   4897

## 연습문제

* data 폴더 안에 있는 auto.csv를 데이터 프레임으로 불러오시오
* 데이터 프레임의 각 열들을 살펴보고, 수치형 값을 가진 열들만 골라서 numeric 이라는 이름의 변수에 저장하시오
* 데이터 프레임의 각 열들을 살펴보고, 범주형 값을 가진 열들만 골라서 categorical 이라는 이름의 변수에 저장하시오
* 전체 데이터에서 열단위로 제조국가, 연도, 배기량, 무게을 선택하고 행단위로 50행부터 100행의 데이터를 선택하시오